import type { SettlementBoundaryCollection } from '../../types';

export const settlementBoundaries: SettlementBoundaryCollection = {
  "ariel": {
    "centroid": {
      "lat": 32.16637,
      "lng": 34.837502
    },
    "geojson": {
      "type": "LineString",
      "coordinates": [
        [
          34.8378376,
          32.1659703
        ],
        [
          34.8377496,
          32.1660775
        ],
        [
          34.8369186,
          32.1670616
        ]
      ]
    },
    "sourceName": "אריאל, ויצמן, הרצליה, נפת תל אביב, מחוז תל אביב, 4648528, ישראל",
    "distanceKm": 32.27
  },
  "efrat": {
    "centroid": {
      "lat": 31.794145,
      "lng": 35.167173
    },
    "geojson": {
      "type": "Point",
      "coordinates": [
        35.167173,
        31.794145
      ]
    },
    "sourceName": "מוצא / יקב אפרת, 3985, ירושלים | القدس, נפת ירושלים, מחוז ירושלים, 9546522, ישראל",
    "distanceKm": 15.61
  },
  "kedumim": {
    "centroid": {
      "lat": 32.182086,
      "lng": 34.932977
    },
    "geojson": {
      "type": "LineString",
      "coordinates": [
        [
          34.9349606,
          32.1815822
        ],
        [
          34.9342832,
          32.1817736
        ],
        [
          34.9342356,
          32.181787
        ],
        [
          34.9333318,
          32.182042
        ],
        [
          34.9332416,
          32.1820647
        ],
        [
          34.9329692,
          32.1821335
        ],
        [
          34.9322491,
          32.1823422
        ],
        [
          34.9317579,
          32.1823839
        ],
        [
          34.9315177,
          32.1823899
        ],
        [
          34.931225,
          32.1823655
        ]
      ]
    },
    "sourceName": "קדומים, כפר סבא, נפת פתח תקווה, מחוז המרכז, 4445810, ישראל",
    "distanceKm": 20.66
  },
  "gush_etzion": {
    "centroid": {
      "lat": 32.084786,
      "lng": 34.903958
    },
    "geojson": {
      "type": "LineString",
      "coordinates": [
        [
          34.9040973,
          32.0857306
        ],
        [
          34.9041512,
          32.0855699
        ],
        [
          34.9041695,
          32.0853102
        ],
        [
          34.9041298,
          32.0850981
        ],
        [
          34.904045,
          32.0849028
        ],
        [
          34.9038881,
          32.0846356
        ],
        [
          34.9038735,
          32.0846109
        ],
        [
          34.9038534,
          32.0845435
        ],
        [
          34.9038207,
          32.0844341
        ],
        [
          34.9038184,
          32.0842784
        ],
        [
          34.903818,
          32.0842488
        ],
        [
          34.9038332,
          32.0840682
        ]
      ]
    },
    "sourceName": "גוש עציון, קריית אלעזר, יוספטל - קריית אלון - קריית אלעזר, פתח תקווה, נפת פתח תקווה, מחוז המרכז, 4932404, ישראל",
    "distanceKm": 51.53
  },
  "kiryat_arba": {
    "centroid": {
      "lat": 31.713753,
      "lng": 34.982268
    },
    "geojson": {
      "type": "LineString",
      "coordinates": [
        [
          34.9825999,
          31.7139378
        ],
        [
          34.9825558,
          31.7138431
        ],
        [
          34.9824928,
          31.7136187
        ],
        [
          34.9824616,
          31.7135921
        ],
        [
          34.9823828,
          31.7135859
        ],
        [
          34.9811163,
          31.7139409
        ]
      ]
    },
    "sourceName": "קרית ארבע, שז\"ר, רמת בית שמש א, בית שמש, נפת ירושלים, מחוז ירושלים, 9920828, ישראל",
    "distanceKm": 24.41
  },
  "beit_el": {
    "centroid": {
      "lat": 32.030486,
      "lng": 34.844196
    },
    "geojson": {
      "type": "LineString",
      "coordinates": [
        [
          34.8444814,
          32.0302444
        ],
        [
          34.8439116,
          32.0307285
        ]
      ]
    },
    "sourceName": "בית אל, רמת פנקס, אור יהודה, נפת תל אביב, מחוז תל אביב, 6022103, ישראל",
    "distanceKm": 37.95
  },
  "givat_zeev": {
    "centroid": {
      "lat": 31.825986,
      "lng": 35.260518
    },
    "geojson": {
      "type": "Polygon",
      "coordinates": [
        [
          [
            35.25961,
            31.82591
          ],
          [
            35.26061,
            31.82534
          ],
          [
            35.26169,
            31.82614
          ],
          [
            35.26014,
            31.82671
          ],
          [
            35.25961,
            31.82591
          ]
        ]
      ]
    },
    "sourceName": "גבעת הפרפרים, פסגת זאב, ירושלים | القدس, נפת ירושלים, מחוז ירושלים, ישראל",
    "distanceKm": 9.15
  }
} as const;
